rainforest/app/controllers/products_controller.rb

	def index
		@title = "All Products"
		@products = Product.all
---
SELECT "products".* FROM "products"

	def create
		@title = 'Create New Product'

		@product = Product.new
		@product.name = params[:product][:name]
		@product.description = params[:product][:description]
		@product.price_in_cents = params[:product][:price_in_cents]

		if @product.save
---
INSERT INTO "products" ("name", "description", "price_in_cents", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "behrams laptop"], ["description", "nice one"], ["price_in_cents", 2], ["created_at", "2018-04-19 16:41:16.188403"], ["updated_at", "2018-04-19 16:41:16.188403"]]

	def edit
		id = params[:id]
		@product = Product.find(id)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

	def update
		@product = Product.find(params[:id])

		@product.name = params[:product][:name]
		@product.description = params[:product][:description]
		@product.price_in_cents = params[:product][:price_in_cents]

		if @product.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "products" SET "price_in_cents" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price_in_cents", 22], ["updated_at", "2018-04-19 16:50:10.845013"], ["id", 4]]