rainforest/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("customer_id", "product_id", "review", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["customer_id", 1], ["product_id", 1], ["review", "nkhjn"], ["created_at", "2018-04-19 19:16:51.717782"], ["updated_at", "2018-04-19 19:16:51.717782"]]
---
	def create
		#puts "Creating new review"
		@review = Review.new

		@review.review = params[:review][:review]
		puts ".............................#{@review.review}"
		@review.product_id = params[:product_id]
		 #check server log to make this clear
		 @review.customer_id = 1
		puts ".............................#{@review.product_id}"
		if @review.save