app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
	def index
		@title = "All Products"
		@products = Product.all

INSERT INTO "products" ("name", "description", "price_in_cents", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "shashike"], ["description", "cool"], ["price_in_cents", 50], ["created_at", "2018-04-19 17:31:24.299841"], ["updated_at", "2018-04-19 17:31:24.299841"]]
---
	def create
		@title = 'Create New Product'

		@product = Product.new
		@product.name = params[:product][:name]
		@product.description = params[:product][:description]
		@product.price_in_cents = params[:product][:price_in_cents]

		if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		id = params[:id]
		@product = Product.find(id)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "price_in_cents" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "shashike mac"], ["price_in_cents", 500], ["updated_at", "2018-04-19 20:02:59.768412"], ["id", 1]]
---
	def update
		@product = Product.find(params[:id])

		@product.name = params[:product][:name]
		@product.description = params[:product][:description]
		@product.price_in_cents = params[:product][:price_in_cents]

		if @product.save