app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("customer_id", "product_id", "review", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["customer_id", 1], ["product_id", 1], ["review", "test review"], ["created_at", "2018-04-19 20:12:04.947429"], ["updated_at", "2018-04-19 20:12:04.947429"]]
---
	def create
		#puts "Creating new review"
		@review = Review.new

		@review.review = params[:review][:review]
		@review.product_id = params[:product_id]
		 #check server log to make this clear
		 @review.customer_id = 1
		if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		id = params[:id]
		@review = Review.find(id)

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "review" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["review", "test reviewes"], ["updated_at", "2018-04-19 21:22:22.115336"], ["id", 1]]
---
	def update
		id = params[:product_id]
		@review = Review.find(params[:id])
		@product = Product.find(params[:product_id])

		@review.review = params[:review][:review]

		if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 2]]
---
	def destroy
		id = params[:product_id]
		@review = Review.find(params[:id])
		@review.destroy